Ran Plan for dir: `.` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/home/atlantis/.atlantis/repos/ryan-longoria/socialmedia_automation/4/default/prod-default.tfplan" -var-file=tfvars/prod-ue2-animeutopia.tfvars -var-file=/home/atlantis/.atlantis/prod-ue2-animeutopia.tfvars' in '/home/atlantis/.atlantis/repos/ryan-longoria/socialmedia_automation/4/default': exit status 1
Wrote /home/atlantis/.atlantis/prod-ue2-animeutopia.tfvars with secrets from SSM.

aws_cloudwatch_event_rule.workflow_schedule: Refreshing state... [id=anime_workflow_schedule]
aws_iam_role.step_functions_role: Refreshing state... [id=anime_step_functions_role]
aws_iam_role.lambda_role: Refreshing state... [id=anime_lambda_role]
aws_s3_bucket.media_bucket: Refreshing state... [id=prod-ue2-animeutopia-media-bucket]
aws_iam_role.eventbridge_role: Refreshing state... [id=eventbridge_step_functions_role]
aws_lambda_function.process_content: Refreshing state... [id=process_content]
aws_iam_role_policy_attachment.lambda_basic_execution: Refreshing state... [id=anime_lambda_role-20250223211702348800000001]
aws_lambda_function.render_video: Refreshing state... [id=render_video]
aws_lambda_function.save_video: Refreshing state... [id=save_video]
aws_lambda_function.fetch_rss: Refreshing state... [id=fetch_rss]
aws_lambda_function.store_data: Refreshing state... [id=store_data]
aws_sfn_state_machine.anime_workflow: Refreshing state... [id=arn:aws:states:us-east-2:851725522400:stateMachine:anime_workflow]
aws_cloudwatch_event_target.state_machine_target: Refreshing state... [id=anime_workflow_schedule-StepFunctionStateMachine]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_iam_policy.eventbridge_policy will be created
  + resource "aws_iam_policy" "eventbridge_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for CloudWatch Event to start Step Functions executions"
      + id               = (known after apply)
      + name             = "eventbridge_step_functions_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "states:StartExecution"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:states:us-east-2:851725522400:stateMachine:anime_workflow"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "DeployedBy" = "Terraform"
        }
    }

  # aws_iam_policy.step_functions_policy will be created
  + resource "aws_iam_policy" "step_functions_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for Step Functions to invoke Lambda functions"
      + id               = (known after apply)
      + name             = "anime_step_functions_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "lambda:InvokeFunction",
                          + "lambda:InvokeAsync",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:lambda:us-east-2:851725522400:function:fetch_rss",
                          + "arn:aws:lambda:us-east-2:851725522400:function:process_content",
                          + "arn:aws:lambda:us-east-2:851725522400:function:store_data",
                          + "arn:aws:lambda:us-east-2:851725522400:function:render_video",
                          + "arn:aws:lambda:us-east-2:851725522400:function:save_video",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "DeployedBy" = "Terraform"
        }
    }

  # aws_iam_role_policy_attachment.attach_eventbridge_policy will be created
  + resource "aws_iam_role_policy_attachment" "attach_eventbridge_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eventbridge_step_functions_role"
    }

  # aws_iam_role_policy_attachment.attach_step_functions_policy will be created
  + resource "aws_iam_role_policy_attachment" "attach_step_functions_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "anime_step_functions_role"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with aws_s3_bucket.media_bucket,
│   on main.tf line 8, in resource "aws_s3_bucket" "media_bucket":
│    8: resource "aws_s3_bucket" "media_bucket" {
│ 
│ Use the aws_s3_bucket_versioning resource instead
│ 
│ (and 3 more similar warnings elsewhere)
╵
╷
│ Error: reading EventBridge Target (anime_workflow_schedule-StepFunctionStateMachine): operation error EventBridge: ListTargetsByRule, https response error StatusCode: 400, RequestID: b329ea44-110f-4c71-b805-c81a6bbbb0e6, api error AccessDeniedException: User: arn:aws:sts::851725522400:assumed-role/Atlantis-EC2-Role/i-01f4df6528d781d4c is not authorized to perform: events:ListTargetsByRule on resource: arn:aws:events:us-east-2:851725522400:rule/anime_workflow_schedule because no identity-based policy allows the events:ListTargetsByRule action
│ 
│   with aws_cloudwatch_event_target.state_machine_target,
│   on sfn.tf line 104, in resource "aws_cloudwatch_event_target" "state_machine_target":
│  104: resource "aws_cloudwatch_event_target" "state_machine_target" {
│ 
╵

```
</details>